test/performance/config.yml
config:
  target: 'http://localhost:3000'
  environments:
    docker:
      target: 'http://weather_api:3000'
  phases:
    - name: "Warm up"
      duration: 30
      arrivalRate: 1
    - name: "Ramp up linearly"
      duration: 30
      arrivalRate: 1
      rampTo: 5
    - name: "Sustained max load"
      duration: 60
      arrivalRate: 5
    - name: "Cool down linearly"
      duration: 30
      arrivalRate: 5
      rampTo: 1
  ensure:
    maxErrorRate: 1 # error rate should be 1% or less